app/controllers/contacts_controller.rb

  def autocomplete_search
    #results = Contact.find_with_ferret(params[:query])
    words = params[:query].split(' ')
    conditions = []

    words.each do |word|
      conditions << "first_name LIKE '%#{word}%' OR last_name LIKE '%#{word}%'"
    end
    conditions = conditions.join(" OR ")
    logger.debug conditions
    results = Contact.find(:all, :conditions => conditions)
---
SELECT * FROM "contacts" WHERE (first_name LIKE '%adam%' OR last_name LIKE '%adam%' OR first_name LIKE '%w%' OR last_name LIKE '%w%')